Revit 2024 API
AnalyticalElement.GetReference Method
 Returns a reference to a given curve within the Analytical Element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public Reference GetReference(
	AnalyticalModelSelector selector
)
Visual Basic
Public Function GetReference ( _
	selector As AnalyticalModelSelector _
) As Reference
Visual C++
public:
Reference^ GetReference(
	AnalyticalModelSelector^ selector
)
Parameters
selector
Type: Autodesk.Revit.DB.Structure.AnalyticalModelSelector
 Specifies where in the Analytical Element the reference lies.
Return Value
 Requested reference.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  selector is not valid for this AnalyticalElement.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
AnalyticalElement Class
Autodesk.Revit.DB.Structure Namespace